;********************************************************************************
; file: os_cpu_a.s
; brief:   RTOS 的底层汇编接口
;********************************************************************************

; 1. 声明：承诺堆栈是 8 字节对齐的
    PRESERVE8

; 2. 声明：我们要使用 Thumb 指令集 (Cortex-M3 必须用这个)
    THUMB

; 3. 定义段 (Section)
;    AREA: 告诉汇编器这是一段代码
;    |.text|: 段的名字 (C语言编译出来的代码通常也放在这个段)
;    CODE: 类型是代码
;    READONLY: 只读 (放在 Flash 里)
    AREA    |.text|, CODE, READONLY

; 4. 导出符号 (相当于 C 语言的头文件声明，让别人能调用它)
;    PendSV_Handler 是 STM32 启动文件里默认的中断名
    EXPORT  PendSV_Handler


; 5. 引入外部符号 (相当于 C 语言的 extern，我们要访问 C 里的变量)
;    IMPORT  currentTCB  ; 假设你在 C 里定义的全局变量叫 currentTCB


;===============================================================================
; 函数实现
;===============================================================================


; 6. 文件结束 (必须有，且必须放在最后一行)
    END